# TransformAndScaleVector Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..TransformAndScaleVector Method
ExporterIFCUtils Class See Also
---
Converts a vector from global Revit coordinates to current IFC coordinates, including scale.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static XYZ TransformAndScaleVector(
	ExporterIFC exporterIFC,
	XYZ origVector
)
```

Visual Basic
---
```text
Public Shared Function TransformAndScaleVector ( _
	exporterIFC As ExporterIFC, _
	origVector As XYZ _
) As XYZ
```

Visual C++
---
```text
public:
static XYZ^ TransformAndScaleVector(
	ExporterIFC^ exporterIFC,
	XYZ^ origVector
)
```

# ### Parameters
exporterIFC
    Type: Autodesk.Revit.DB.IFC..::..ExporterIFC The exporter.
origVector
    Type: Autodesk.Revit.DB..::..XYZ The original vector.
# ### Return Value
The transformed and scaled point.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace